# **Advanced** Aggregations ðŸ“’

In [1]:
import pandas as pd

### Creating a sample DataFrame

In [2]:
data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Department': ['HR', 'HR', 'IT', 'IT', 'Sales', 'Sales'],
    'Salary': [60000, 65000, 70000, 72000, 80000, 85000],
    'Years': [2, 3, 4, 5, 6, 7]
}
df = pd.DataFrame(data)

df

  Employee Department  Salary  Years
0    Alice         HR   60000      2
1      Bob         HR   65000      3
2  Charlie         IT   70000      4
3    David         IT   72000      5
4      Eve      Sales   80000      6
5    Frank      Sales   85000      7

### **Puzzle 1**
`Group by` a column and calculate the **mean** of another column.

In [3]:
mean_sal = df.groupby('Department')['Salary'].mean()

mean_sal

Department
HR       62500.0
IT       71000.0
Sales    82500.0
Name: Salary, dtype: float64

### **Puzzle 2**
`Group by` **multiple** columns and calculate the sum.

In [4]:
sum_salary_years = df.groupby(['Department', 'Employee']).sum()

sum_salary_years

                     Salary  Years
Department Employee
HR         Alice      60000      2
           Bob        65000      3
IT         Charlie    70000      4
           David      72000      5
Sales      Eve        80000      6
           Frank      85000      7

### **Puzzle 3**
**Pivot** table with aggregation.

In [26]:
pivot_table = df.pivot_table(
    index='Department', columns='Years', values='Salary', aggfunc='mean')

pivot_table

Years             2        3        4        5        6        7
Department
HR          60000.0  65000.0      NaN      NaN      NaN      NaN
IT              NaN      NaN  70000.0  72000.0      NaN      NaN
Sales           NaN      NaN      NaN      NaN  80000.0  85000.0

### **Puzzle 4**
Calculate the difference between the **highest** and **lowest** salary in each department.

In [9]:
salary_range = df.groupby('Department')['Salary'].agg(lambda x: x.max() - x.min())

salary_range

Department
HR       5000
IT       2000
Sales    5000
Name: Salary, dtype: int64

### **Puzzle 5**
Calculate the **cumulative sum** of salaries in each department.

In [12]:
cumulative_salary = df.groupby('Department')['Salary'].cumsum()

cumulative_salary

0     60000
1    125000
2     70000
3    142000
4     80000
5    165000
Name: Salary, dtype: int64

### **Puzzle 6**
**Filter** groups based on aggregation criteria.<br>
Here, we are filtering out the rows having **mean** salary > `70000`.

In [28]:
high_salary_groups = df.groupby('Department').filter(lambda x: x['Salary'].mean() > 70000)

high_salary_groups

  Employee Department  Salary  Years
2  Charlie         IT   70000      4
3    David         IT   72000      5
4      Eve      Sales   80000      6
5    Frank      Sales   85000      7

### **Puzzle 7**
Create a **multi-level** aggregation.

In [29]:
multi_agg = df.groupby('Department').agg({
    'Salary': ['mean', 'max'],
    'Years': ['min', 'max']
})

multi_agg

             Salary        Years
               mean    max   min max
Department
HR          62500.0  65000     2   3
IT          71000.0  72000     4   5
Sales       82500.0  85000     6   7

### **Puzzle 8**
Apply **multiple** aggregation functions to a group.

In [30]:
multiple_agg_funcs = df.groupby('Department')['Salary'].agg(['mean', 'std', 'max'])

multiple_agg_funcs

               mean          std    max
Department
HR          62500.0  3535.533906  65000
IT          71000.0  1414.213562  72000
Sales       82500.0  3535.533906  85000

### **Puzzle 9**
Calculate the **rank** of each employee within their department based on **salary**.

In [31]:
df['Salary_Rank'] = df.groupby('Department')['Salary'].rank(ascending=False)

df

  Employee Department  Salary  Years  Salary_Rank
0    Alice         HR   60000      2          2.0
1      Bob         HR   65000      3          1.0
2  Charlie         IT   70000      4          2.0
3    David         IT   72000      5          1.0
4      Eve      Sales   80000      6          2.0
5    Frank      Sales   85000      7          1.0

### **Puzzle 10**
Calculate a **rolling average** of salaries within each department.

In [48]:
rolling_avg_salary = df.groupby("Department")['Salary'].rolling(window=2).mean().dropna().reset_index(level=1, drop=True)

rolling_avg_salary

Department
HR       62500.0
IT       71000.0
Sales    82500.0
Name: Salary, dtype: float64

In [ ]:
# Feel free to code ...